app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.username = params[:user][:username]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    @user.email = params[:user][:email]

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `password_digest`, `updated_at`, `username`) VALUES ('2012-06-12 00:25:07', 'evan.mcewen@gmail.com', '$2a$10$Ohy5Bx/pAGA0M0MN3hAxoOxPIe1yR3rvRPz1N9lAs7bEfrckgf3BG', '2012-06-12 00:25:07', 'Evan')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1